alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4700.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ERU0</name>
			<description>Event Request Unit 0</description>
			<groupName>ERU</groupName>
			<headerStructName>ERU</headerStructName>
			<baseAddress>0x50004800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0100</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ERU0_0</name>
				<description>External Request Unit 0</description>
				<value>1</value>
			</interrupt>
			<interrupt>
				<name>ERU0_1</name>
				<description>External Request Unit 0</description>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>ERU0_2</name>
				<description>External Request Unit 0</description>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>ERU0_3</name>
				<description>External Request Unit 0</description>
				<value>4</value>
			</interrupt>
			<registers>
				<register>
					<name>EXISEL</name>
					<description>Event Input Select</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXS0A</name>
							<description>Event Source Select for A0 (ERS0)</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input ERU_0A0 is selected</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_0A1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_0A2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_0A3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXS0B</name>
							<description>Event Source Select for B0 (ERS0)</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input ERU_0B0 is selected</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_0B1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_0B2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_0B3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXS1A</name>
							<description>Event Source Select for A1 (ERS1)</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input ERU_1A0 is selected</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_1A1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_1A2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_1A3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXS1B</name>
							<description>Event Source Select for B1 (ERS1)</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input ERU_1B0 is selected</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_1B1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_1B2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_1B3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXS2A</name>
							<description>Event Source Select for A2 (ERS2)</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input ERU_2A0 is selected</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_2A1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_2A2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_2A3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXS2B</name>
							<description>Event Source Select for B2 (ERS2)</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input ERU_2B0 is selected</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_2B1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_2B2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_2B3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXS3A</name>
							<description>Event Source Select for A3 (ERS3)</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input ERU_3A0 is selected</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_3A1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_3A2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_3A3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXS3B</name>
							<description>Event Source Select for B3 (ERS3)</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input ERU_3B0 is selected</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_3B1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_3B2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_3B3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>EXICON[%s]</name>
					<description>Event Input Control</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PE</name>
							<description>Output Trigger Pulse Enable for ETLx</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The trigger pulse generation is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The trigger pulse generation is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LD</name>
							<description>Rebuild Level Detection for Status Flag for ETLx</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The status flag FL is not cleared by hardware and is used as "sticky" bit. Once set, it is not influenced by any edge until it becomes cleared by software.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The status flag FL rebuilds a level detection of the desired event. It becomes automatically set with a rising edge if RE = 1 or with a falling edge if FE = 1. It becomes automatically cleared with a rising edge if RE = 0 or with a falling edge if FE = 0.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RE</name>
							<description>Rising Edge Detection Enable ETLx</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A rising edge is not considered as edge event</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A rising edge is considered as edge event</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FE</name>
							<description>Falling Edge Detection Enable ETLx</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A falling edge is not considered as edge event</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A falling edge is considered as edge event</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCS</name>
							<description>Output Channel Select for ETLx Output Trigger Pulse</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trigger pulses are sent to OGU0</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trigger pulses are sent to OGU1</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Trigger pulses are sent to OGU2</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Trigger pulses are sent to OGU3</description>
									<value>#011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FL</name>
							<description>Status Flag for ETLx</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The enabled edge event has not been detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The enabled edge event has been detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SS</name>
							<description>Input Source Select for ERSx</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input A without additional combination</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input B without additional combination</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input A OR input B</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input A AND input B</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NA</name>
							<description>Input A Negation Select for ERSx</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input A is used directly</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input A is inverted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NB</name>
							<description>Input B Negation Select for ERSx</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input B is used directly</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input B is inverted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>EXOCON[%s]</name>
					<description>Event Output Trigger Control</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000008</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ISS</name>
							<description>Internal Trigger Source Selection</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The peripheral trigger function is disabled</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input ERU_OGUy1 is selected</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input ERU_OGUy2 is selected</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input ERU_OGUy3 is selected</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GEEN</name>
							<description>Gating Event Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The event detection is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The event detection is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDR</name>
							<description>Pattern Detection Result Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A pattern miss is detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A pattern match is detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GP</name>
							<description>Gating Selection for Pattern Detection Result</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ERU_GOUTy is always disabled and ERU_IOUTy can not be activated</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>ERU_GOUTy is always enabled and ERU_IOUTy becomes activated with each activation of ERU_TOUTy</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>ERU_GOUTy is equal to ERU_PDOUTy and ERU_IOUTy becomes activated with an activation of ERU_TOUTy while the desired pattern is detected (pattern match PDR = 1)</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>ERU_GOUTy is inverted to ERU_PDOUTy and ERU_IOUTy becomes activated with an activation of ERU_TOUTy while the desired pattern is not detected (pattern miss PDR = 0)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPEN0</name>
							<description>Pattern Detection Enable for ETL0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Flag EXICONx.FL is excluded from the pattern detection</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Flag EXICONx.FL is included in the pattern detection</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPEN1</name>
							<description>Pattern Detection Enable for ETL1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Flag EXICONx.FL is excluded from the pattern detection</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Flag EXICONx.FL is included in the pattern detection</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPEN2</name>
							<description>Pattern Detection Enable for ETL2</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Flag EXICONx.FL is excluded from the pattern detection</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Flag EXICONx.FL is included in the pattern detection</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPEN3</name>
							<description>Pattern Detection Enable for ETL3</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Flag EXICONx.FL is excluded from the pattern detection</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Flag EXICONx.FL is included in the pattern detection</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
