alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4700.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="GPDMA0_CH2">
			<name>GPDMA0_CH3</name>
			<description>General Purpose DMA Unit 0</description>
			<groupName>GPDMA</groupName>
			<baseAddress>0x50014108</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x55</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="GPDMA0_CH2">
			<name>GPDMA0_CH4</name>
			<description>General Purpose DMA Unit 0</description>
			<groupName>GPDMA</groupName>
			<baseAddress>0x50014160</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x55</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="GPDMA0_CH2">
			<name>GPDMA0_CH5</name>
			<description>General Purpose DMA Unit 0</description>
			<groupName>GPDMA</groupName>
			<baseAddress>0x500141B8</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x55</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="GPDMA0_CH2">
			<name>GPDMA0_CH6</name>
			<description>General Purpose DMA Unit 0</description>
			<groupName>GPDMA</groupName>
			<baseAddress>0x50014210</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x55</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="GPDMA0_CH2">
			<name>GPDMA0_CH7</name>
			<description>General Purpose DMA Unit 0</description>
			<groupName>GPDMA</groupName>
			<baseAddress>0x50014268</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x55</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>GPDMA1</name>
			<description>General Purpose DMA Unit 1</description>
			<groupName>GPDMA</groupName>
			<baseAddress>0x500182C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x7D40</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GPDMA1_0</name>
				<description>General Purpose DMA Unit 1</description>
				<value>110</value>
			</interrupt>
			<registers>
				<register>
					<name>RAWTFR</name>
					<description>Raw IntTfr Status</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWBLOCK</name>
					<description>Raw IntBlock Status</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWSRCTRAN</name>
					<description>Raw IntSrcTran Status</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWDSTTRAN</name>
					<description>Raw IntBlock Status</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWERR</name>
					<description>Raw IntErr Status</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Raw Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Raw Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Raw Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Raw Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSTFR</name>
					<description>IntTfr Status</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSBLOCK</name>
					<description>IntBlock Status</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSSRCTRAN</name>
					<description>IntSrcTran Status</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSDSTTRAN</name>
					<description>IntBlock Status</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUSERR</name>
					<description>IntErr Status</description>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Interrupt Status for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH1</name>
							<description>Interrupt Status for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH2</name>
							<description>Interrupt Status for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CH3</name>
							<description>Interrupt Status for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MASKTFR</name>
					<description>Mask for Raw IntTfr Status</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WE_CH0</name>
							<description>Write enable for mask bit of channel 0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>write disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>write enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WE_CH1</name>
							<description>Write enable for mask bit of channel 1</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>write disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>write enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WE_CH2</name>
							<description>Write enable for mask bit of channel 2</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>write disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>write enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WE_CH3</name>
							<description>Write enable for mask bit of channel 3</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>write disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>write enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH0</name>
							<description>Mask bit for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>masked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unmasked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Mask bit for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>masked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unmasked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Mask bit for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>masked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unmasked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3</name>
							<description>Mask bit for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>masked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unmasked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MASKBLOCK</name>
					<description>Mask for Raw IntBlock Status</description>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WE_CH0</name>
							<description>Write enable for mask bit of channel 0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>write disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>write enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WE_CH1</name>
							<description>Write enable for mask bit of channel 1</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>write disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>write enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WE_CH2</name>
							<description>Write enable for mask bit of channel 2</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>write disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>write enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WE_CH3</name>
							<description>Write enable for mask bit of channel 3</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>write disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>write enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH0</name>
							<description>Mask bit for channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>masked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unmasked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Mask bit for channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>masked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unmasked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Mask bit for channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>masked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unmasked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3</name>
							<description>Mask bit for channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>masked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>unmasked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
