alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4700.svd
				<register>
					<name>LDCMP1</name>
					<description>LED Compare Register 1</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_LD4</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD5</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD6</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LDA_TSCOM</name>
							<description>Compare Value for LED COLA / Common Compare Value for Touch-sense Pad Turns</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCMP0</name>
					<description>Touch-sense Compare Register 0</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_TS0</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS1</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS2</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS3</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCMP1</name>
					<description>Touch-sense Compare Register 1</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_TS4</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS5</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS6</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS7</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SDMMC_CON</name>
			<description>SD and Multimediacard Control Register</description>
			<baseAddress>0x500040B4</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SDMMC_CON</name>
					<description>SDMMC Configuration</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WPSEL</name>
							<description>SDMMC Write Protection Input Multiplexer Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>P1.1 input pin selected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Software bit WPVAL is selected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WPSVAL</name>
							<description>SDMMC Write Protect Software Control</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No write protection</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Write protection active</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDSEL</name>
							<description>SDMMC Card Detection Control</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>P1.10 input pin selected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Software bit CDSVAL is selected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDSVAL</name>
							<description>SDMMC Write Protect Software Control</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No card detected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Card detected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
