alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4700.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ETH0</name>
			<description>Ethernet Unit 0</description>
			<groupName>ETH</groupName>
			<headerStructName>ETH</headerStructName>
			<baseAddress>0x5000C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ETH0_0</name>
				<description>Ethernet (Module 0)</description>
				<value>108</value>
			</interrupt>
			<registers>
				<register>
					<name>MAC_CONFIGURATION</name>
					<description>MAC Configuration Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00008000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRELEN</name>
							<description>Preamble Length for Transmit Frames</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RE</name>
							<description>Receiver Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TE</name>
							<description>Transmitter Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DC</name>
							<description>Deferral Check</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BL</name>
							<description>Back-Off Limit</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ACS</name>
							<description>Automatic Pad or CRC Stripping</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DR</name>
							<description>Disable Retry</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPC</name>
							<description>Checksum Offload</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Duplex Mode</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LM</name>
							<description>Loopback Mode</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DO</name>
							<description>Disable Receive Own</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FES</name>
							<description>Speed</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCRS</name>
							<description>Disable Carrier Sense During Transmission</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IFG</name>
							<description>Inter-Frame Gap</description>
							<lsb>17</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>JE</name>
							<description>Jumbo Frame Enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BE</name>
							<description>Frame Burst Enable</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>JD</name>
							<description>Jabber Disable</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WD</name>
							<description>Watchdog Disable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TC</name>
							<description>Transmit Configuration in RMII</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CST</name>
							<description>CRC Stripping of Type Frames</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TWOKPE</name>
							<description>IEEE 802.3as support for 2K packets Enable</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SARC</name>
							<description>Source Address Insertion or Replacement Control</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_FRAME_FILTER</name>
					<description>MAC Frame Filter</description>
					<addressOffset>0x0004</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PR</name>
							<description>Promiscuous Mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HUC</name>
							<description>Hash Unicast</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HMC</name>
							<description>Hash Multicast</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DAIF</name>
							<description>DA Inverse Filtering</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PM</name>
							<description>Pass All Multicast</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DBF</name>
							<description>Disable Broadcast Frames</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PCF</name>
							<description>Pass Control Frames</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SAIF</name>
							<description>SA Inverse Filtering</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SAF</name>
							<description>Source Address Filter Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HPF</name>
							<description>Hash or Perfect Filter</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VTFE</name>
							<description>VLAN Tag Filter Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IPFE</name>
							<description>Layer 3 and Layer 4 Filter Enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DNTU</name>
							<description>Drop non-TCP/UDP over IP Frames</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RA</name>
							<description>Receive All</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HASH_TABLE_HIGH</name>
					<description>Hash Table High Register</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HTH</name>
							<description>Hash Table High</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HASH_TABLE_LOW</name>
					<description>Hash Table Low Register</description>
					<addressOffset>0x000C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HTL</name>
							<description>Hash Table Low</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GMII_ADDRESS</name>
					<description>MII Address Register</description>
					<addressOffset>0x0010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MB</name>
							<description>MII Busy</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MW</name>
							<description>MII Write</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CR</name>
							<description>CSR Clock Range</description>
							<lsb>2</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MR</name>
							<description>MII Register</description>
							<lsb>6</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PA</name>
							<description>Physical Layer Address</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GMII_DATA</name>
					<description>MII Data Register</description>
					<addressOffset>0x0014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MD</name>
							<description>MII Data</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLOW_CONTROL</name>
					<description>Flow Control Register</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FCA_BPA</name>
							<description>Flow Control Busy or Backpressure Activate</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TFE</name>
							<description>Transmit Flow Control Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RFE</name>
							<description>Receive Flow Control Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Unicast Pause Frame Detect</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PLT</name>
							<description>Pause Low Threshold</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DZPQ</name>
							<description>Disable Zero-Quanta Pause</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PT</name>
							<description>Pause Time</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VLAN_TAG</name>
					<description>VLAN Tag Register</description>
					<addressOffset>0x001C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VL</name>
							<description>VLAN Tag Identifier for Receive Frames</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETV</name>
							<description>Enable 12-Bit VLAN Tag Comparison</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VTIM</name>
							<description>VLAN Tag Inverse Match Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESVL</name>
							<description>Enable S-VLAN</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>VTHM</name>
							<description>VLAN Tag Hash Table Match Enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VERSION</name>
					<description>Version Register</description>
					<addressOffset>0x0020</addressOffset>
					<size>32</size>
					<resetValue>0x00001037</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SNPSVER</name>
							<description>Synopsys-defined Version (3.7)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>USERVER</name>
							<description>User-defined Version (Configured with the coreConsultant)</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DEBUG</name>
					<description>Debug Register</description>
					<addressOffset>0x0024</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RPESTS</name>
							<description>MAC MII Receive Protocol Engine Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RFCFCSTS</name>
							<description>MAC Receive Frame Controller FIFO Status</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RWCSTS</name>
							<description>MTL Rx FIFO Write Controller Active Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RRCSTS</name>
							<description>MTL Rx FIFO Read Controller State</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFSTS</name>
							<description>MTL Rx FIFO Fill-level Status</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TPESTS</name>
							<description>MAC MII Transmit Protocol Engine Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TFCSTS</name>
							<description>MAC Transmit Frame Controller Status</description>
							<lsb>17</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXPAUSED</name>
							<description>MAC transmitter in PAUSE</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TRCSTS</name>
							<description>MTL Tx FIFO Read Controller Status</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TWCSTS</name>
							<description>MTL Tx FIFO Write Controller Active Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXFSTS</name>
							<description>MTL Tx FIFO Not Empty Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXSTSFSTS</name>
							<description>MTL TxStatus FIFO Full Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REMOTE_WAKE_UP_FRAME_FILTER</name>
					<description>Remote Wake Up Frame Filter Register</description>
					<addressOffset>0x0028</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WKUPFRMFTR</name>
							<description>Remote Wake-Up Frame Filter</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMT_CONTROL_STATUS</name>
					<description>PMT Control and Status Register</description>
					<addressOffset>0x002C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWRDWN</name>
							<description>Power Down</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MGKPKTEN</name>
							<description>Magic Packet Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWKPKTEN</name>
							<description>Wake-Up Frame Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MGKPRCVD</name>
							<description>Magic Packet Received</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RWKPRCVD</name>
							<description>Wake-Up Frame Received</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GLBLUCAST</name>
							<description>Global Unicast</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWKFILTRST</name>
							<description>Wake-Up Frame Filter Register Pointer Reset</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTERRUPT_STATUS</name>
					<description>Interrupt Register</description>
					<addressOffset>0x0038</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PMTIS</name>
							<description>PMT Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCIS</name>
							<description>MMC Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCRXIS</name>
							<description>MMC Receive Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCTXIS</name>
							<description>MMC Transmit Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCRXIPIS</name>
							<description>MMC Receive Checksum Offload Interrupt Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSIS</name>
							<description>Timestamp Interrupt Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTERRUPT_MASK</name>
					<description>Interrupt Mask Register</description>
					<addressOffset>0x003C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PMTIM</name>
							<description>PMT Interrupt Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSIM</name>
							<description>Timestamp Interrupt Mask</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS0_HIGH</name>
					<description>MAC Address0 High Register</description>
					<addressOffset>0x0040</addressOffset>
					<size>32</size>
					<resetValue>0x8000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address0 [47:32]</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS0_LOW</name>
					<description>MAC Address0 Low Register</description>
					<addressOffset>0x0044</addressOffset>
					<size>32</size>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address0 [31:0]</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS1_HIGH</name>
					<description>MAC Address1 High Register</description>
					<addressOffset>0x0048</addressOffset>
					<size>32</size>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address1 [47:32]</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS1_LOW</name>
					<description>MAC Address1 Low Register</description>
					<addressOffset>0x004C</addressOffset>
					<size>32</size>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address1 [31:0]</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
