alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4700.svd
				<register>
					<name>MAC_ADDRESS2_HIGH</name>
					<description>MAC Address2 High Register</description>
					<addressOffset>0x0050</addressOffset>
					<size>32</size>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address2 [47:32]</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS2_LOW</name>
					<description>MAC Address2 Low Register</description>
					<addressOffset>0x0054</addressOffset>
					<size>32</size>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address2 [31:0]</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS3_HIGH</name>
					<description>MAC Address3 High Register</description>
					<addressOffset>0x0058</addressOffset>
					<size>32</size>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRHI</name>
							<description>MAC Address3 [47:32]</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MBC</name>
							<description>Mask Byte Control</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SA</name>
							<description>Source Address</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AE</name>
							<description>Address Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MAC_ADDRESS3_LOW</name>
					<description>MAC Address3 Low Register</description>
					<addressOffset>0x005C</addressOffset>
					<size>32</size>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRLO</name>
							<description>MAC Address3 [31:0]</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MMC_CONTROL</name>
					<description>MMC Control Register</description>
					<addressOffset>0x0100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CNTRST</name>
							<description>Counters Reset</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTSTOPRO</name>
							<description>Counters Stop Rollover</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTONRD</name>
							<description>Reset on Read</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTFREEZ</name>
							<description>MMC Counter Freeze</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTPRST</name>
							<description>Counters Preset</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTPRSTLVL</name>
							<description>Full-Half Preset</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UCDBC</name>
							<description>Update MMC Counters for Dropped Broadcast Frames</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MMC_RECEIVE_INTERRUPT</name>
					<description>MMC Receive Interrupt Register</description>
					<addressOffset>0x0104</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXGBFRMIS</name>
							<description>MMC Receive Good Bad Frame Counter Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXGBOCTIS</name>
							<description>MMC Receive Good Bad Octet Counter Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXGOCTIS</name>
							<description>MMC Receive Good Octet Counter Interrupt Status.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXBCGFIS</name>
							<description>MMC Receive Broadcast Good Frame Counter Interrupt Status.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXMCGFIS</name>
							<description>MMC Receive Multicast Good Frame Counter Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXCRCERFIS</name>
							<description>MMC Receive CRC Error Frame Counter Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXALGNERFIS</name>
							<description>MMC Receive Alignment Error Frame Counter Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXRUNTFIS</name>
							<description>MMC Receive Runt Frame Counter Interrupt Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXJABERFIS</name>
							<description>MMC Receive Jabber Error Frame Counter Interrupt Status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUSIZEGFIS</name>
							<description>MMC Receive Undersize Good Frame Counter Interrupt Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXOSIZEGFIS</name>
							<description>MMC Receive Oversize Good Frame Counter Interrupt Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX64OCTGBFIS</name>
							<description>MMC Receive 64 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX65T127OCTGBFIS</name>
							<description>MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX128T255OCTGBFIS</name>
							<description>MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX256T511OCTGBFIS</name>
							<description>MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX512T1023OCTGBFIS</name>
							<description>MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RX1024TMAXOCTGBFIS</name>
							<description>MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUCGFIS</name>
							<description>MMC Receive Unicast Good Frame Counter Interrupt Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXLENERFIS</name>
							<description>MMC Receive Length Error Frame Counter Interrupt Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXORANGEFIS</name>
							<description>MMC Receive Out Of Range Error Frame Counter Interrupt Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXPAUSFIS</name>
							<description>MMC Receive Pause Frame Counter Interrupt Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFOVFIS</name>
							<description>MMC Receive FIFO Overflow Frame Counter Interrupt Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXVLANGBFIS</name>
							<description>MMC Receive VLAN Good Bad Frame Counter Interrupt Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXWDOGFIS</name>
							<description>MMC Receive Watchdog Error Frame Counter Interrupt Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXRCVERRFIS</name>
							<description>MMC Receive Error Frame Counter Interrupt Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXCTRLFIS</name>
							<description>MMC Receive Control Frame Counter Interrupt Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MMC_TRANSMIT_INTERRUPT</name>
					<description>MMC Transmit Interrupt Register</description>
					<addressOffset>0x0108</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXGBOCTIS</name>
							<description>MMC Transmit Good Bad Octet Counter Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXGBFRMIS</name>
							<description>MMC Transmit Good Bad Frame Counter Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXBCGFIS</name>
							<description>MMC Transmit Broadcast Good Frame Counter Interrupt Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXMCGFIS</name>
							<description>MMC Transmit Multicast Good Frame Counter Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX64OCTGBFIS</name>
							<description>MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Status.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX65T127OCTGBFIS</name>
							<description>MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX128T255OCTGBFIS</name>
							<description>MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX256T511OCTGBFIS</name>
							<description>MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX512T1023OCTGBFIS</name>
							<description>MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX1024TMAXOCTGBFIS</name>
							<description>MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXUCGBFIS</name>
							<description>MMC Transmit Unicast Good Bad Frame Counter Interrupt Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXMCGBFIS</name>
							<description>MMC Transmit Multicast Good Bad Frame Counter Interrupt Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXBCGBFIS</name>
							<description>MMC Transmit Broadcast Good Bad Frame Counter Interrupt Status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXUFLOWERFIS</name>
							<description>MMC Transmit Underflow Error Frame Counter Interrupt Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXSCOLGFIS</name>
							<description>MMC Transmit Single Collision Good Frame Counter Interrupt Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXMCOLGFIS</name>
							<description>MMC Transmit Multiple Collision Good Frame Counter Interrupt Status</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXDEFFIS</name>
							<description>MMC Transmit Deferred Frame Counter Interrupt Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXLATCOLFIS</name>
							<description>MMC Transmit Late Collision Frame Counter Interrupt Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXEXCOLFIS</name>
							<description>MMC Transmit Excessive Collision Frame Counter Interrupt Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXCARERFIS</name>
							<description>MMC Transmit Carrier Error Frame Counter Interrupt Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXGOCTIS</name>
							<description>MMC Transmit Good Octet Counter Interrupt Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXGFRMIS</name>
							<description>MMC Transmit Good Frame Counter Interrupt Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXEXDEFFIS</name>
							<description>MMC Transmit Excessive Deferral Frame Counter Interrupt Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXPAUSFIS</name>
							<description>MMC Transmit Pause Frame Counter Interrupt Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXVLANGFIS</name>
							<description>MMC Transmit VLAN Good Frame Counter Interrupt Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXOSIZEGFIS</name>
							<description>MMC Transmit Oversize Good Frame Counter Interrupt Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MMC_RECEIVE_INTERRUPT_MASK</name>
					<description>MMC Reveive Interrupt Mask Register</description>
					<addressOffset>0x010C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXGBFRMIM</name>
							<description>MMC Receive Good Bad Frame Counter Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXGBOCTIM</name>
							<description>MMC Receive Good Bad Octet Counter Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXGOCTIM</name>
							<description>MMC Receive Good Octet Counter Interrupt Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXBCGFIM</name>
							<description>MMC Receive Broadcast Good Frame Counter Interrupt Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXMCGFIM</name>
							<description>MMC Receive Multicast Good Frame Counter Interrupt Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXCRCERFIM</name>
							<description>MMC Receive CRC Error Frame Counter Interrupt Mask</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXALGNERFIM</name>
							<description>MMC Receive Alignment Error Frame Counter Interrupt Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXRUNTFIM</name>
							<description>MMC Receive Runt Frame Counter Interrupt Mask</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXJABERFIM</name>
							<description>MMC Receive Jabber Error Frame Counter Interrupt Mask</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUSIZEGFIM</name>
							<description>MMC Receive Undersize Good Frame Counter Interrupt Mask</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXOSIZEGFIM</name>
							<description>MMC Receive Oversize Good Frame Counter Interrupt Mask</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX64OCTGBFIM</name>
							<description>MMC Receive 64 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX65T127OCTGBFIM</name>
							<description>MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX128T255OCTGBFIM</name>
							<description>MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX256T511OCTGBFIM</name>
							<description>MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX512T1023OCTGBFIM</name>
							<description>MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RX1024TMAXOCTGBFIM</name>
							<description>MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUCGFIM</name>
							<description>MMC Receive Unicast Good Frame Counter Interrupt Mask</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXLENERFIM</name>
							<description>MMC Receive Length Error Frame Counter Interrupt Mask</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXORANGEFIM</name>
							<description>MMC Receive Out Of Range Error Frame Counter Interrupt Mask</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXPAUSFIM</name>
							<description>MMC Receive Pause Frame Counter Interrupt Mask</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXFOVFIM</name>
							<description>MMC Receive FIFO Overflow Frame Counter Interrupt Mask</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXVLANGBFIM</name>
							<description>MMC Receive VLAN Good Bad Frame Counter Interrupt Mask</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXWDOGFIM</name>
							<description>MMC Receive Watchdog Error Frame Counter Interrupt Mask</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXRCVERRFIM</name>
							<description>MMC Receive Error Frame Counter Interrupt Mask</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXCTRLFIM</name>
							<description>MMC Receive Control Frame Counter Interrupt Mask</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
