alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4700.svd
				<register>
					<name>RXICMP_ERROR_OCTETS</name>
					<description>Receive ICMP Error Octets Register</description>
					<addressOffset>0x0284</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXICMPERROCT</name>
							<description>Number of bytes received in an ICMP segment with checksum errors</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMESTAMP_CONTROL</name>
					<description>Timestamp Control Register</description>
					<addressOffset>0x0700</addressOffset>
					<size>32</size>
					<resetValue>0x00002000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSENA</name>
							<description>Timestamp Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCFUPDT</name>
							<description>Timestamp Fine or Coarse Update</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSINIT</name>
							<description>Timestamp Initialize</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSUPDT</name>
							<description>Timestamp Update</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTRIG</name>
							<description>Timestamp Interrupt Trigger Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSADDREG</name>
							<description>Addend Reg Update</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSENALL</name>
							<description>Enable Timestamp for All Frames</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCTRLSSR</name>
							<description>Timestamp Digital or Binary Rollover Control</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSVER2ENA</name>
							<description>Enable PTP packet Processing for Version 2 Format</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSIPENA</name>
							<description>Enable Processing of PTP over Ethernet Frames</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSIPV6ENA</name>
							<description>Enable Processing of PTP Frames Sent Over IPv6-UDP</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSIPV4ENA</name>
							<description>Enable Processing of PTP Frames Sent over IPv4-UDP</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSEVNTENA</name>
							<description>Enable Timestamp Snapshot for Event Messages</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSMSTRENA</name>
							<description>Enable Snapshot for Messages Relevant to Master</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SNAPTYPSEL</name>
							<description>Select PTP packets for Taking Snapshots</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSENMACADDR</name>
							<description>Enable MAC address for PTP Frame Filtering</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUB_SECOND_INCREMENT</name>
					<description>Sub-Second Increment Register</description>
					<addressOffset>0x0704</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSINC</name>
							<description>Sub-second Increment Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTEM_TIME_SECONDS</name>
					<description>System Time - Seconds Register</description>
					<addressOffset>0x0708</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSS</name>
							<description>Timestamp Second</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTEM_TIME_NANOSECONDS</name>
					<description>System Time Nanoseconds Register</description>
					<addressOffset>0x070C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSSS</name>
							<description>Timestamp Sub Seconds</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTEM_TIME_SECONDS_UPDATE</name>
					<description>System Time - Seconds Update Register</description>
					<addressOffset>0x0710</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSS</name>
							<description>Timestamp Second</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTEM_TIME_NANOSECONDS_UPDATE</name>
					<description>System Time Nanoseconds Update Register</description>
					<addressOffset>0x0714</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSSS</name>
							<description>Timestamp Sub Second</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADDSUB</name>
							<description>Add or subtract time</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMESTAMP_ADDEND</name>
					<description>Timestamp Addend Register</description>
					<addressOffset>0x0718</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSAR</name>
							<description>Timestamp Addend Register</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TARGET_TIME_SECONDS</name>
					<description>Target Time Seconds Register</description>
					<addressOffset>0x071C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSTR</name>
							<description>Target Time Seconds Register</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TARGET_TIME_NANOSECONDS</name>
					<description>Target Time Nanoseconds Register</description>
					<addressOffset>0x0720</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TTSLO</name>
							<description>Target Timestamp Low Register</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRGTBUSY</name>
							<description>Target Time Register Busy</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTEM_TIME_HIGHER_WORD_SECONDS</name>
					<description>System Time - Higher Word Seconds Register</description>
					<addressOffset>0x0724</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSHWR</name>
							<description>Timestamp Higher Word Register</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMESTAMP_STATUS</name>
					<description>Timestamp Status Register</description>
					<addressOffset>0x0728</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSSOVF</name>
							<description>Timestamp Seconds Overflow</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTARGT</name>
							<description>Timestamp Target Time Reached</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRGTERR</name>
							<description>Timestamp Target Time Error</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTARGT1</name>
							<description>Timestamp Target Time Reached for Target Time PPS1</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRGTERR1</name>
							<description>Timestamp Target Time Error</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTARGT2</name>
							<description>Timestamp Target Time Reached for Target Time PPS2</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRGTERR2</name>
							<description>Timestamp Target Time Error</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTARGT3</name>
							<description>Timestamp Target Time Reached for Target Time PPS3</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSTRGTERR3</name>
							<description>Timestamp Target Time Error</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_MODE</name>
					<description>Bus Mode Register</description>
					<addressOffset>0x1000</addressOffset>
					<size>32</size>
					<resetValue>0x00020101</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SWR</name>
							<description>Software Reset</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DA</name>
							<description>DMA Arbitration Scheme</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DSL</name>
							<description>Descriptor Skip Length</description>
							<lsb>2</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ATDS</name>
							<description>Alternate Descriptor Size</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PBL</name>
							<description>Programmable Burst Length</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PR</name>
							<description>Priority Ratio</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FB</name>
							<description>Fixed Burst</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RPBL</name>
							<description>Rx DMA PBL</description>
							<lsb>17</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USP</name>
							<description>Use Seperate PBL</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PBLX8</name>
							<description>8xPBL Mode</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AAL</name>
							<description>Address Aligned Beats</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MB</name>
							<description>Mixed Burst</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXPR</name>
							<description>Transmit Priority</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRWG</name>
							<description>Channel Priority Weights</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRANSMIT_POLL_DEMAND</name>
					<description>Transmit Poll Demand Register</description>
					<addressOffset>0x1004</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TPD</name>
							<description>Transmit Poll Demand</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RECEIVE_POLL_DEMAND</name>
					<description>Receive Poll Demand Register</description>
					<addressOffset>0x1008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RPD</name>
							<description>Receive Poll Demand</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RECEIVE_DESCRIPTOR_LIST_ADDRESS</name>
					<description>Receive Descriptor Address Register</description>
					<addressOffset>0x100C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RDESLA_32bit</name>
							<description>Start of Receive List</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRANSMIT_DESCRIPTOR_LIST_ADDRESS</name>
					<description>Transmit descripter Address Register</description>
					<addressOffset>0x1010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TDESLA_32bit</name>
							<description>Start of Transmit List</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x1014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TI</name>
							<description>Transmit Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TPS</name>
							<description>Transmit Process Stopped</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TU</name>
							<description>Transmit Buffer Unavailable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TJT</name>
							<description>Transmit Jabber Timeout</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVF</name>
							<description>Receive Overflow</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UNF</name>
							<description>Transmit Underflow</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RI</name>
							<description>Receive Interrupt</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RU</name>
							<description>Receive Buffer Unavailable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RPS</name>
							<description>Receive Process Stopped</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWT</name>
							<description>Receive Watchdog Timeout</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETI</name>
							<description>Early Transmit Interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FBI</name>
							<description>Fatal Bus Error Interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERI</name>
							<description>Early Receive Interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS</name>
							<description>Abnormal Interrupt Summary</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NIS</name>
							<description>Normal Interrupt Summary</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RS</name>
							<description>Received Process State</description>
							<lsb>17</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TS</name>
							<description>Transmit Process State</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EB</name>
							<description>Error Bits</description>
							<lsb>23</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMI</name>
							<description>ETH MMC Interrupt</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EPI</name>
							<description>ETH PMT Interrupt</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TTI</name>
							<description>Timestamp Trigger Interrupt</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OPERATION_MODE</name>
					<description>Operation Mode Register</description>
					<addressOffset>0x1018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SR</name>
							<description>Start or Stop Receive</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OSF</name>
							<description>Operate on Second Frame</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTC</name>
							<description>Receive Threshold Control</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FUF</name>
							<description>Forward Undersized Good Frames</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEF</name>
							<description>Forward Error Frames</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ST</name>
							<description>Start or Stop Transmission Command</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TTC</name>
							<description>Transmit Threshold Control</description>
							<lsb>14</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FTF</name>
							<description>Flush Transmit FIFO</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSF</name>
							<description>Transmit Store and Forward</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DFF</name>
							<description>Disable Flushing of Received Frames</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSF</name>
							<description>Receive Store and Forward</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DT</name>
							<description>Disable Dropping of TCP/IP Checksum Error Frames</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
