alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4700.svd
				<register>
					<name>REVNP1</name>
					<description>Result Event Node Pointer Register 1</description>
					<addressOffset>0x01B4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REV8NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV9NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV10NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV11NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV12NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV13NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV14NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV15NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SEVNP</name>
					<description>Source Event Node Pointer Register</description>
					<addressOffset>0x01C0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEV0NP</name>
							<description>Service Request Node Pointer Source Event i</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEV1NP</name>
							<description>Service Request Node Pointer Source Event i</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SRACT</name>
					<description>Service Request Software Activation Trigger</description>
					<addressOffset>0x01C8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AGSR0</name>
							<description>Activate Group Service Request Node 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activate the associated service request line</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AGSR1</name>
							<description>Activate Group Service Request Node 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activate the associated service request line</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AGSR2</name>
							<description>Activate Group Service Request Node 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activate the associated service request line</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AGSR3</name>
							<description>Activate Group Service Request Node 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activate the associated service request line</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASSR0</name>
							<description>Activate Shared Service Request Node 0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activate the associated service request line</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASSR1</name>
							<description>Activate Shared Service Request Node 1</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activate the associated service request line</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASSR2</name>
							<description>Activate Shared Service Request Node 2</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activate the associated service request line</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASSR3</name>
							<description>Activate Shared Service Request Node 3</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activate the associated service request line</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EMUXCTR</name>
					<description>E0ternal Multiplexer Control Register</description>
					<addressOffset>0x01F0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EMUXSET</name>
							<description>External Multiplexer Start Selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EMUXACT</name>
							<description>External Multiplexer Actual Selection</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUXCH</name>
							<description>External Multiplexer Channel Select</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EMUXMODE</name>
							<description>External Multiplexer Mode</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Software control (no hardware action)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Steady mode (use EMUXSET value)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Single-step mode</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Sequence mode</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMXCOD</name>
							<description>External Multiplexer Coding Scheme</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output the channel number in binary code</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output the channel number in Gray code</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMXST</name>
							<description>External Multiplexer Sample Time Control</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Use STCE whenever the setting changes</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Use STCE for each conversion of an external channel</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMXCSS</name>
							<description>External Multiplexer Channel Selection Style</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel number: Bitfield EMUXCH selects an arbitrary channel</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel enable: Each bit of bitfield EMUXCH selects the associated channel for EMUX control</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMXWC</name>
							<description>Write Control for EMUX Configuration</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No write access to EMUX cfg.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfields EMXMODE, EMXCOD, EMXST, EMXCSS can be written</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
