alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4700.svd
				<register>
					<name>ECRD1</name>
					<description>Extended Read Back 1</description>
					<addressOffset>0x0BC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>CAPV</name>
							<description>Timer Capture Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FPCV</name>
							<description>Prescaler Capture value</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPTR</name>
							<description>Slice pointer</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CC40</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CC41</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CC42</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CC43</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VPTR</name>
							<description>Capture register pointer</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Capture register 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Capture register 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Capture register 2</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Capture register 3</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FFL</name>
							<description>Full Flag</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No new value was captured into this register</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A new value has been captured into this register</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LCV</name>
							<description>Lost Capture Value</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No capture was lost</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A capture was lost</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU40_CC41</name>
			<description>Capture Compare Unit 4 - Unit 0</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x4000C200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU40_CC42</name>
			<description>Capture Compare Unit 4 - Unit 0</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x4000C300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU40_CC43</name>
			<description>Capture Compare Unit 4 - Unit 0</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x4000C400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU41_CC40</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010100</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU41_CC41</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU41_CC42</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU41_CC43</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU42_CC40</name>
			<description>Capture Compare Unit 4 - Unit 2</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40014100</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
